OpenFoam_Shapes/Square/design_points/design_point_2/0/Ccy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9600
(
-7.4747821
-7.4747821
-7.4747821
-7.4747821
-7.4747821
-7.4747821
-7.4747821
-7.4747821
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-5.4748845
-5.4748845
-5.4748845
-5.4748845
-5.4748845
-5.4748845
-5.4748845
-5.4748845
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-7.5
-7.5
-7.5
-7.5
-7.5
-7.5
-7.5
-7.5
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
7.5
7.5
7.5
7.5
7.5
7.5
7.5
7.5
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
7.3125
6.9375
6.5625
6.1875
5.8125
5.4375
5.0625
4.6875
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-7.3125
-6.9375
-6.5625
-6.1875
-5.8125
-5.4375
-5.0625
-4.6875
...
)
;
    }
}


// ************************************************************************* //
